Family [Family Name] is corrupt and its instances cannot be updated. Please reload the family to repair the project..
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId CannotRegenerateCorruptFamily { get; }
  Visual Basic
Public Shared ReadOnly Property CannotRegenerateCorruptFamily As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ CannotRegenerateCorruptFamily {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures FamilyFailures Class
  Autodesk.Revit.DB Namespace